Autodesk.Revit.DB.ExportLayerTable.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.ExportLayerTable.GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.ExportLayerTable.GetExportLayerTableIterator
Returns a LayerTableIterator to the pattern table.
Since:
2014

Autodesk.Revit.DB.ExportLayerTable.Clear
Removes all contents stored in the table.
Since:
2014

Autodesk.Revit.DB.ExportLayerTable.Remove(Autodesk.Revit.DB.ExportLayerKey)
Removes the pair (key, info) by pattern key.
exportLayerKey:
The export pattern key.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLayerTable.Add(Autodesk.Revit.DB.ExportLayerKey,Autodesk.Revit.DB.ExportLayerInfo)
Inserts a (key,info) pair into Export layer table.
exportLayerKey:
The export layer key to be added.
exportLayerInfo:
The export layer info to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The key already exists in the table.
-or-
The layer info does not contain the Category as a modifier type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLayerTable.GetValues
Returns all the values stored in the map.
Returns:
Return the info array.
Since:
2014

Autodesk.Revit.DB.ExportLayerTable.GetKeys
Gets all the keys stored in the map.
Returns:
Return the key array.
Since:
2014

Autodesk.Revit.DB.ExportLayerTable.GetExportLayerInfo(Autodesk.Revit.DB.ExportLayerKey)
Gets a copy of the layer info associated to the input pattern key.
exportLayerKey:
The export layer Key.
Returns:
Return the layerInfo for this key.
Throws Autodesk.Revit.Exceptions.ArgumentException:
An entry with the given key is not present in the table.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLayerTable.ContainsKey(Autodesk.Revit.DB.ExportLayerKey)
Checks whether a layer key exists in the table.
exportlayerKey:
The export layer Key.
Returns:
True if the layer key exists in the table.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLayerTable.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExportLayerTable.Count
Count of the items contained in the collection.
Since:
2014

Autodesk.Revit.DB.ExportLayerTable.GetAvaliableLayerModifierTypes(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ExportLayerKey)
Gets all the avaliable layer modifier types for the layer key.
document:
A Revit document to retrieve avaliable layer modifier types from.
exportLayerKey:
The export layer key to specify wich category and subCategory will be used to get the layer modifier types.
Returns:
The layer modifier types.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLayerTable.default(Autodesk.Revit.DB.ExportLayerKey)
A copy of the Autodesk.Revit.DB.ExportLayerInfo item that corresponds to the layer's
Autodesk.Revit.DB.ExportLayerKey.
Remarks: When getting this property, it returns a copy of the Autodesk.Revit.DB.ExportLayerInfo from the table.  In order to
make changes to the Autodesk.Revit.DB.ExportLayerInfo and use those settings during export, set the modified
Autodesk.Revit.DB.ExportLayerInfo back into the table using the same key.
ExportLayerKey:
The key.
Returns:
A copy of the Autodesk.Revit.DB.ExportLayerInfo for the layer Key.
Throws Autodesk.Revit.Exceptions.ArgumentException: When getting this property:
An entry with the given key is not present in the table.
Since:
2014

Autodesk.Revit.DB.ExportLayerTable.GetLayerTableIterator
Returns a LayerTableIterator that iterates through the collection.
Returns: A LayerTableIterator object that can be used to iterate through key-value pairs in the collection.

Autodesk.Revit.DB.ExportLayerTable.#ctor
Constructs a new ExportLayerTable with default values.
Since:
2014

Autodesk.Revit.DB.ExportLayerTable
A table supporting a mapping of category and subcategory to layer name and other layer properties that will be set
in the target export format.
Remarks:
This table is structured as a mapping from Autodesk.Revit.DB.ExportLayerKey to
Autodesk.Revit.DB.ExportLayerInfo members.  The Autodesk.Revit.DB.ExportLayerKey
contains the indentification information for the layer table: the Revit category and subcategory names.  In addition,
the key contains a Autodesk.Revit.DB.SpecialType member used only to represent non-Revit categories
that can be assigned specific layer information on export.  The Autodesk.Revit.DB.ExportLayerInfo
contains the exported layer name, color name, and layer modifiers for standard and cut representations.
The table can be accessed via direct iteration as a collection of KeyValuePairs, or by traversal of the stored keys
obtained from GetKeys(), or via specific lookup of a key constructed externally.  In all cases, the
Autodesk.Revit.DB.ExportLayerInfo returned will be a copy of the Autodesk.Revit.DB.ExportLayerInfo
from the table.  In order to make changes to the Autodesk.Revit.DB.ExportLayerInfo and use those settings during export,
set the modified Autodesk.Revit.DB.ExportLayerInfo back into the table using the same key.
Since:
2014